inference/load_testing/vegeta/fastapi/classification/llama_7B/results1.txt
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             9.21s, 0s, 9.21s
Latencies     [min, mean, 50, 90, 95, 99, max]  9.21s, 9.21s, 9.21s, 9.21s, 9.21s, 9.21s, 9.21s
Bytes In      [total, mean]                     677, 677.00
Bytes Out     [total, mean]                     451, 451.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             9.213s, 0s, 9.213s
Latencies     [min, mean, 50, 90, 95, 99, max]  9.213s, 9.213s, 9.213s, 9.213s, 9.213s, 9.213s, 9.213s
Bytes In      [total, mean]                     655, 655.00
Bytes Out     [total, mean]                     459, 459.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         1, 1.00, 1.00
Duration      [total, attack, wait]             9.214s, 0s, 9.214s
Latencies     [min, mean, 50, 90, 95, 99, max]  9.214s, 9.214s, 9.214s, 9.214s, 9.214s, 9.214s, 9.214s
Bytes In      [total, mean]                     655, 655.00
Bytes Out     [total, mean]                     459, 459.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 0.11
Duration      [total, attack, wait]             18.462s, 499.901ms, 17.962s
Latencies     [min, mean, 50, 90, 95, 99, max]  17.962s, 18.01s, 18.01s, 18.057s, 18.057s, 18.057s, 18.057s
Bytes In      [total, mean]                     1298, 649.00
Bytes Out     [total, mean]                     906, 453.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 0.11
Duration      [total, attack, wait]             18.44s, 499.976ms, 17.94s
Latencies     [min, mean, 50, 90, 95, 99, max]  17.94s, 17.984s, 17.984s, 18.029s, 18.029s, 18.029s, 18.029s
Bytes In      [total, mean]                     1310, 655.00
Bytes Out     [total, mean]                     918, 459.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         2, 4.00, 0.11
Duration      [total, attack, wait]             18.466s, 499.964ms, 17.966s
Latencies     [min, mean, 50, 90, 95, 99, max]  17.966s, 18.011s, 18.011s, 18.056s, 18.056s, 18.056s, 18.056s
Bytes In      [total, mean]                     1360, 680.00
Bytes Out     [total, mean]                     968, 484.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:2
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 0.11
Duration      [total, attack, wait]             27.547s, 666.768ms, 26.881s
Latencies     [min, mean, 50, 90, 95, 99, max]  26.718s, 26.816s, 26.849s, 26.881s, 26.881s, 26.881s, 26.881s
Bytes In      [total, mean]                     1932, 644.00
Bytes Out     [total, mean]                     1344, 448.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 0.11
Duration      [total, attack, wait]             27.68s, 666.752ms, 27.013s
Latencies     [min, mean, 50, 90, 95, 99, max]  27.013s, 27.224s, 27.192s, 27.466s, 27.466s, 27.466s, 27.466s
Bytes In      [total, mean]                     2040, 680.00
Bytes Out     [total, mean]                     1452, 484.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         3, 4.50, 0.11
Duration      [total, attack, wait]             27.602s, 666.664ms, 26.935s
Latencies     [min, mean, 50, 90, 95, 99, max]  26.935s, 27.14s, 27.137s, 27.347s, 27.347s, 27.347s, 27.347s
Bytes In      [total, mean]                     1947, 649.00
Bytes Out     [total, mean]                     1359, 453.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set:
Requests      [total, rate, throughput]         4, 5.33, 0.00
Duration      [total, attack, wait]             30.75s, 750.001ms, 30s
Latencies     [min, mean, 50, 90, 95, 99, max]  30s, 30s, 30s, 30s, 30s, 30s, 30s
Bytes In      [total, mean]                     0, 0.00
Requests      [total, rate, throughput]         3, 4.50, 0.11
Duration      [total, attack, wait]             27.602s, 666.664ms, 26.935s
Latencies     [min, mean, 50, 90, 95, 99, max]  26.935s, 27.14s, 27.137s, 27.347s, 27.347s, 27.347s, 27.347s
Bytes In      [total, mean]                     1947, 649.00
Bytes Out     [total, mean]                     1359, 453.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3
Error Set: